first_routes_and_controllers/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "alan"], ["email", "alan@aa.com"], ["updated_at", "2022-05-04 18:56:20.342573"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(params.require(:user).permit(:name, :email))