Art_Share_API/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 4]]
---
  def index
    @artworks = Artwork.find_by(params[:artist_id])