Art_Share_API/app/controllers/artworks_controller.rb

  def index
    @artworks = User.find(params[:user_id]).artworks
    @shared = User.find(params[:user_id]).artwork_shares
---
SELECT  "artworks".* FROM "artworks" WHERE (3) LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]