Art_Share_API/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
      @user = User.find(params[:id])