Art_Share_API/app/controllers/users_controller.rb

    def index
        if params[:username]
            render json: User.search(params[:username])
        else
            @users = User.all
---
SELECT "users".* FROM "users" WHERE (user[username] LIKE (''))
SELECT "users".* FROM "users"

    def favorite_artworks
        render json: User.find(params[:user_id]).favorite_artworks
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def favorite_shared_artworks
        render json: User.find(params[:user_id]).favorite_shared_artworks
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]