Art_Share_API/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Tom"], ["LIMIT", 1]]
---
    def self.search(search)
        if search
            @username = User.find_by(username: search)